CSI API ETABS v1
cDetailing.GetDetailedWall_OneWallStack_OneSpandrel_OneLongBarInfo Method
 Represents Rebars in one Spandrel on a particular story , as defined in ETABS
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedWall_OneWallStack_OneSpandrel_OneLongBarInfo(
	int WallStackIndex,
	int SpandrelIndex,
	int LongBarIndex,
	ref double BarSize_Dia,
	ref double BarSize_Area,
	ref double BarSize_Fy,
	ref string BarSize_Notation,
	ref int NumberPoints,
	ref double[] X,
	ref double[] Y,
	ref double[] Z,
	ref int StartType,
	ref int EndType
)
Function GetDetailedWall_OneWallStack_OneSpandrel_OneLongBarInfo (
	WallStackIndex As Integer,
	SpandrelIndex As Integer,
	LongBarIndex As Integer,
	ByRef BarSize_Dia As Double,
	ByRef BarSize_Area As Double,
	ByRef BarSize_Fy As Double,
	ByRef BarSize_Notation As String,
	ByRef NumberPoints As Integer,
	ByRef X As Double(),
	ByRef Y As Double(),
	ByRef Z As Double(),
	ByRef StartType As Integer,
	ByRef EndType As Integer
) As Integer
Dim instance As cDetailing
Dim WallStackIndex As Integer
Dim SpandrelIndex As Integer
Dim LongBarIndex As Integer
Dim BarSize_Dia As Double
Dim BarSize_Area As Double
Dim BarSize_Fy As Double
Dim BarSize_Notation As String
Dim NumberPoints As Integer
Dim X As Double()
Dim Y As Double()
Dim Z As Double()
Dim StartType As Integer
Dim EndType As Integer
Dim returnValue As Integer
returnValue = instance.GetDetailedWall_OneWallStack_OneSpandrel_OneLongBarInfo(WallStackIndex,
	SpandrelIndex, LongBarIndex, BarSize_Dia,
	BarSize_Area, BarSize_Fy, BarSize_Notation,
	NumberPoints, X, Y, Z, StartType, EndType)
int GetDetailedWall_OneWallStack_OneSpandrel_OneLongBarInfo(
	int WallStackIndex,
	int SpandrelIndex,
	int LongBarIndex,
	double% BarSize_Dia,
	double% BarSize_Area,
	double% BarSize_Fy,
	String^% BarSize_Notation,
	int% NumberPoints,
	array<double>^% X,
	array<double>^% Y,
	array<double>^% Z,
	int% StartType,
	int% EndType
)
abstract GetDetailedWall_OneWallStack_OneSpandrel_OneLongBarInfo :
        WallStackIndex : int *
        SpandrelIndex : int *
        LongBarIndex : int *
        BarSize_Dia : float byref *
        BarSize_Area : float byref *
        BarSize_Fy : float byref *
        BarSize_Notation : string byref *
        NumberPoints : int byref *
        X : float[] byref *
        Y : float[] byref *
        Z : float[] byref *
        StartType : int byref *
        EndType : int byref -> int
Parameters
WallStackIndex
Type: System.Int32
 Wall Stack Index
SpandrelIndex
Type: System.Int32
 Spandrel Output Index
LongBarIndex
Type: System.Int32
 Long bar index
BarSize_Dia
Type: System.Double
 Information about the bar In bar group Dia
BarSize_Area
Type: System.Double
 Information about the bar In bar group Area
BarSize_Fy
Type: System.Double
 Information about the bar In bar group Fy
BarSize_Notation
Type: System.String
 Information about the bar In bar group Notation
NumberPoints
Type: System.Int32
 Number of Points
X
Type: System.Double[]
 Coordinates of bar in local beam axis as defined in ETABS (X is along 1, Y is along 2, Z is along 3)
Y
Type: System.Double[]
 Coordinates of bar in local beam axis as defined in ETABS (X is along 1, Y is along 2, Z is along 3)
Z
Type: System.Double[]
 Coordinates of bar in local beam axis as defined in ETABS (X is along 1, Y is along 2, Z is along 3)
StartType
Type: System.Int32
 Represents Bar End Types, Cut, Ben90, Bend180, Bend135
EndType
Type: System.Int32
 Represents Bar End Types, Cut, Ben90, Bend180, Bend135
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace